src/M2_base/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    inlet
    {
        type            patch;
        nFaces          2;
        startFace       20336;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       20338;
    }
    wedge
    {
        type            patch;
        nFaces          40;
        startFace       20438;
    }
    top
    {
        type            patch;
        nFaces          40;
        startFace       20478;
    }
    frontCoarse
    {
        type            patch;
        nFaces          60;
        startFace       20518;
    }
    sideCoarse
    {
        type            patch;
        nFaces          100;
        startFace       20578;
    }
    symmetry
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          60;
        startFace       20678;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4000;
        startFace       20738;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10000;
        startFace       24738;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          6846;
        startFace       34738;
    }
)

// ************************************************************************* //
